{
  "backend/main.mo": "Motoko canister defining categories, channel management types, user profiles, access control, and basic profile CRUD with authorization checks.",
  "feature_evidence.json": "Empty feature evidence report JSON scaffold.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files including hooks, components, pages, and layout.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes using OKLCH color tokens.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Defines TanStack Router setup, application routes, and theme provider for the main React app.",
  "frontend/src/components/account/AccountSummary.tsx": "Displays user name and Bacon Cash balance with a button linking to the purchase page.",
  "frontend/src/components/admin/AdminOnly.tsx": "Wrapper that restricts content to authenticated admin users and shows denial or loading states.",
  "frontend/src/components/adult/AdultGateDialog.tsx": "Modal dialog prompting users to confirm adult content access with warning and action buttons.",
  "frontend/src/components/adult/AdultRouteGuard.tsx": "Route guard that enforces adult-content consent using persistent consent state and a confirmation dialog.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Reusable screen showing an access denied message with navigation back home.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with query cache handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Initial profile setup modal collecting a display name and creating a default user profile.",
  "frontend/src/components/auth/RoleGate.tsx": "Conditional renderer that restricts UI based on authentication, admin status, and optional channel ownership.",
  "frontend/src/components/branding/BrandLogo.tsx": "Clickable RockHog TV logo that navigates to the home page.",
  "frontend/src/components/branding/CategoryIcon.tsx": "Maps category names to icon paths and renders the appropriate image with fallback to music.",
  "frontend/src/components/branding/HeroBanner.tsx": "Displays a large hero image with headline and description overlay text.",
  "frontend/src/components/channels/ChannelCard.tsx": "Shows a clickable channel card with thumbnail, title, category badge, and hover play overlay.",
  "frontend/src/components/channels/ChannelEditorDialog.tsx": "Dialog for creating or editing channels with fields for metadata and thumbnail upload; submits via hooks.",
  "frontend/src/components/channels/ChannelGrid.tsx": "Renders a responsive grid of channel cards with loading and empty states.",
  "frontend/src/components/channels/ThumbnailUploader.tsx": "Provides image upload UI with progress tracking and thumbnail preview using ExternalBlob.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines main app layout with header, nav, footer, authentication-aware components, and profile setup dialog.",
  "frontend/src/components/navigation/PrimaryNav.tsx": "Renders top navigation for main categories and a creator studio link when authenticated.",
  "frontend/src/components/player/StreamEmbed.tsx": "Embeds a stream via iframe or raw embed code, supporting YouTube and Twitch URL conversion.",
  "frontend/src/components/share/ShareButton.tsx": "Share button using Web Share API with clipboard fallback and toast feedback.",
  "frontend/src/game/baconOps/engine/ai.ts": "Empty placeholder file for AI logic.",
  "frontend/src/game/baconOps/engine/constants.ts": "Empty placeholder file for engine constants.",
  "frontend/src/game/baconOps/engine/gameLoop.ts": "Empty placeholder for game loop implementation.",
  "frontend/src/game/baconOps/engine/gameState.ts": "Empty placeholder for game state definitions.",
  "frontend/src/game/baconOps/engine/renderer.ts": "Empty placeholder for rendering logic.",
  "frontend/src/game/baconOps/engine/systems.ts": "Empty placeholder for ECS-style systems.",
  "frontend/src/game/baconOps/engine/types.ts": "Empty placeholder for engine type definitions.",
  "frontend/src/game/baconOps/input/useDesktopControls.ts": "Empty placeholder for desktop control hooks.",
  "frontend/src/game/baconOps/input/useTouchControls.ts": "Empty placeholder for touch control hooks.",
  "frontend/src/game/baconOps/input/VirtualControls.tsx": "Empty placeholder for virtual control UI.",
  "frontend/src/game/baconOps/ui/BaconOpsMainMenu.tsx": "Empty placeholder for main menu UI.",
  "frontend/src/game/baconOps/ui/Hud.tsx": "Empty placeholder for HUD UI.",
  "frontend/src/game/baconOps/ui/RoundOverlay.tsx": "Empty placeholder for round overlay UI.",
  "frontend/src/game/baconOps/ui/StatsPanel.tsx": "Empty placeholder for stats panel UI.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates related queries when it changes.",
  "frontend/src/hooks/useAdultGate.ts": "Provides a hook to read, grant, and revoke adult consent stored in sessionStorage.",
  "frontend/src/hooks/useAuthz.ts": "Defines hooks to fetch the caller’s user role and admin status using react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing identity state, login, and logout via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Contains react-query hooks for fetching and mutating channels, user profiles, and related backend data.",
  "frontend/src/index.css": "Defines global Tailwind layers and custom CSS variables, themes, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AdminBaconCashRequestsPage.tsx": "Admin page to list and fulfill Bacon Cash requests with status indicators and actions.",
  "frontend/src/pages/BaconOpsArenaPage.tsx": "Empty page file reserved for the Bacon Ops Arena view.",
  "frontend/src/pages/BrowseHomePage.tsx": "Renders the home browsing page with categories, hero banner, and recently added channels.",
  "frontend/src/pages/BuyBaconCashPage.tsx": "Provides a form for users to request Bacon Cash purchases and displays their past requests and current balance.",
  "frontend/src/pages/CategoryPage.tsx": "Shows all channels in a selected category, with adult content gated by AdultRouteGuard.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information with a mailto link to the owner's email address.",
  "frontend/src/pages/CreatorStudioPage.tsx": "Lets authenticated users manage their channels, including creating, editing, deleting, and copying channel info.",
  "frontend/src/pages/StreamDetailPage.tsx": "Shows details and video embed for a specific stream, with edit and delete options for owners or admins.",
  "frontend/src/utils/category.ts": "Defines category constants, labels, and helper functions for retrieving category metadata and display names.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, plugin extensions, custom colors, animations, and container settings.",
  "project_state.json": "Defines the project's current state, versioning, features, and architectural notes for RockHog TV."
}