{
  "backend/main.mo": "Motoko canister implementing user profiles, channels, categories, access control, and Bacon Cash storage with authorization and blob storage mixins.",
  "feature_evidence.json": "Metadata report mapping implemented features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten high‑level summaries of all frontend source files for reference.",
  "frontend/index.css": "Tailwind base theme defining OKLCH color variables for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router, app routes, theme provider, and global layout including the Contact page.",
  "frontend/src/components/account/AccountSummary.tsx": "Displays user name and Bacon Cash balance with a button to buy more.",
  "frontend/src/components/admin/AdminOnly.tsx": "Wraps children with admin‑only access logic using auth hooks and shows denial or loader when appropriate.",
  "frontend/src/components/adult/AdultGateDialog.tsx": "Dialog warning users about adult content with confirmation and cancellation options.",
  "frontend/src/components/adult/AdultRouteGuard.tsx": "Route guard requiring adult‑content consent before showing protected content.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Generic access‑denied screen with message and button to return home.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with handling for cached sessions and loading states.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "First‑time user dialog collecting display name and saving an initial profile.",
  "frontend/src/components/auth/RoleGate.tsx": "Gates child components based on user identity, admin status, and optional channel ownership.",
  "frontend/src/components/branding/BrandLogo.tsx": "Clickable brand logo button that navigates to the homepage.",
  "frontend/src/components/branding/CategoryIcon.tsx": "Renders a category-specific icon image with optional sizing.",
  "frontend/src/components/branding/HeroBanner.tsx": "Displays the homepage hero banner with a background image and promotional text.",
  "frontend/src/components/channels/ChannelCard.tsx": "Shows a channel preview card with thumbnail, title, category badge, and navigation to the stream.",
  "frontend/src/components/channels/ChannelEditorDialog.tsx": "Form dialog for creating or editing channels, including fields and thumbnail upload handling.",
  "frontend/src/components/channels/ChannelGrid.tsx": "Displays channels in a responsive grid with loading and empty states.",
  "frontend/src/components/channels/ThumbnailUploader.tsx": "Handles thumbnail image selection, upload progress, previewing, and removal.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, navigation, footer, and optional profile setup dialog.",
  "frontend/src/components/navigation/PrimaryNav.tsx": "Navigation bar for category links and creator studio access.",
  "frontend/src/components/player/StreamEmbed.tsx": "Embeds a stream via iframe, supporting raw embed codes, YouTube, and Twitch URLs.",
  "frontend/src/components/share/ShareButton.tsx": "Share button using Web Share API with clipboard fallback.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdultGate.ts": "Manages user adult-content consent using sessionStorage with functions to grant or revoke consent.",
  "frontend/src/hooks/useAuthz.ts": "Provides hooks to fetch the caller’s role and admin status using the authenticated actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, handling login, stored identity loading, and exposing identity state and actions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for channel operations and user profile actions using the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and theme variables, including light/dark color definitions and custom components.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminBaconCashRequestsPage.tsx": "Admin page listing bacon cash requests with actions to fulfill them and display their status.",
  "frontend/src/pages/BrowseHomePage.tsx": "Browse page showing categories and recently added channels, with navigation to category pages.",
  "frontend/src/pages/BuyBaconCashPage.tsx": "Page for authenticated users to view balance, request Bacon Cash purchases, and track request statuses.",
  "frontend/src/pages/CategoryPage.tsx": "Displays channels filtered by category, with adult categories protected by a route guard.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact information and a mailto link for reaching the site owner.",
  "frontend/src/pages/CreatorStudioPage.tsx": "Creator dashboard for managing channels, including creation, editing, and deletion with dialogs.",
  "frontend/src/pages/StreamDetailPage.tsx": "Shows stream details and player with edit/delete options for owners or admins.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Defines overall project metadata and requirements for building the RockHog TV platform. Lists implemented features, architecture notes, and the app’s content, admin, and currency systems."
}