{
  "backend/main.mo": "Main actor defining Channel, UserProfile, BaconCashRequest, Conversation, and ChatRoom types with persistent storage maps; includes authorization and blob storage mixins, and implements CRUD operations for channels, user profiles, Bacon Cash, AI conversations, and chat rooms with category management.",
  "backend/migration.mo": "Migration module that adds chatRooms map to the actor state and initializes a default 'RockHog Lounge' chat room while preserving existing channels, user profiles, Bacon Cash, and conversation data.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence features for chat room functionality: React Query hooks (useChatRooms.ts), UI components (ChatRoomPage, ChatRoomList, MessageList), routing and navigation integration, and visual theming for the chat interface.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components for layout, navigation, authentication, channels, admin, adult content gating, AI chat, and the new chat room feature with purple-blue themed styling.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point for RockHog TV application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for browse, category, stream, creator studio, Bacon Cash, admin, contact, sign-up, AI chat, and chat room pages, wrapped in ThemeProvider with Toaster for notifications.",
  "frontend/src/components/account/AccountSummary.tsx": "Header widget displaying authenticated user's name and Bacon Cash balance with a 'Buy' button navigating to the purchase page.",
  "frontend/src/components/admin/AdminOnly.tsx": "Authorization wrapper component that shows AccessDeniedScreen unless the user is authenticated and has admin role, with loading state handling.",
  "frontend/src/components/adult/AdultGateDialog.tsx": "Modal dialog requiring age confirmation (18+) before accessing adult content, with warning alert and confirm/cancel actions.",
  "frontend/src/components/adult/AdultRouteGuard.tsx": "A route guard component that displays an age verification dialog for adult content, redirecting users to home if they decline consent.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied screen with a shield icon, customizable message, and a button to return to the home page.",
  "frontend/src/components/auth/LoginButton.tsx": "A button component that handles Internet Identity authentication, toggling between login and logout states with loading indicators.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "A modal dialog that prompts new users to create their profile by entering a display name, initializing their account with zero balances.",
  "frontend/src/components/auth/RoleGate.tsx": "A conditional rendering component that restricts content based on admin status or channel ownership permissions.",
  "frontend/src/components/branding/BrandLogo.tsx": "Displays the RockHog TV logo and brand name as a clickable button that navigates to the home page.",
  "frontend/src/components/branding/CategoryIcon.tsx": "Renders category-specific icons from a predefined set of image assets based on the category name.",
  "frontend/src/components/branding/HeroBanner.tsx": "Displays a full-width hero banner with background image, title, and description promoting the RockHog TV platform.",
  "frontend/src/components/channels/ChannelCard.tsx": "A clickable card component displaying channel thumbnail, title, category badge, and description with hover effects.",
  "frontend/src/components/channels/ChannelEditorDialog.tsx": "A modal dialog form for creating or editing channels with fields for title, category, description, stream URL, and thumbnail upload.",
  "frontend/src/components/channels/ChannelGrid.tsx": "Displays a responsive grid of channel cards with loading and empty state handling.",
  "frontend/src/components/channels/ThumbnailUploader.tsx": "Handles image file upload for channel thumbnails with progress tracking, preview display, and removal functionality.",
  "frontend/src/components/chat/ChatInput.tsx": "A textarea input with send button for chat messages, supporting Enter to send and Shift+Enter for new lines.",
  "frontend/src/components/chat/ChatRoomList.tsx": "Displays a scrollable list of available chat rooms with selection highlighting and loading/error states.",
  "frontend/src/components/chat/ConversationList.tsx": "Displays a scrollable list of AI chat conversations with loading and empty states. Shows conversation previews with message counts and highlights the currently active conversation.",
  "frontend/src/components/chat/MessageBubble.tsx": "Renders individual chat message bubbles with avatars (Sparkles for AI, User icon for human). Styles messages differently based on sender with appropriate alignment and colors.",
  "frontend/src/components/chat/MessageList.tsx": "Displays chat room messages in a scrollable area with auto-scroll on new messages. Shows sender names, timestamps, and handles loading/error/empty states.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout wrapper with header (logo, navigation, auth), footer (copyright, social links, Caffeine.ai attribution), and profile setup dialog. Includes streaming gradient background.",
  "frontend/src/components/navigation/PrimaryNav.tsx": "Primary navigation bar with category buttons (Music, Gaming, Sports, Horror, Adult), AI Chat, Chat Room, and Creator Studio (auth-required). Highlights active route.",
  "frontend/src/components/player/StreamEmbed.tsx": "Embeds video streams from various sources (YouTube, Twitch, raw iframe/embed code). Handles URL parsing and displays error alert if no stream URL is provided.",
  "frontend/src/components/share/ShareButton.tsx": "Share button that uses Web Share API when available, otherwise falls back to clipboard copy. Shows appropriate icon (Share2 or Copy) and toast notifications.",
  "frontend/src/game/baconOps/engine/ai.ts": "Empty file, likely placeholder for BaconOps game AI logic.",
  "frontend/src/game/baconOps/engine/constants.ts": "Empty file, likely placeholder for BaconOps game constants.",
  "frontend/src/game/baconOps/engine/gameLoop.ts": "Empty file, likely placeholder for BaconOps game loop implementation.",
  "frontend/src/game/baconOps/engine/gameState.ts": "Empty file, likely placeholder for BaconOps game state management.",
  "frontend/src/game/baconOps/engine/renderer.ts": "Empty file, likely placeholder for BaconOps game rendering logic.",
  "frontend/src/game/baconOps/engine/systems.ts": "Empty file, likely placeholder for BaconOps game systems (ECS or similar).",
  "frontend/src/game/baconOps/engine/types.ts": "Empty file, likely placeholder for BaconOps game type definitions.",
  "frontend/src/game/baconOps/input/useDesktopControls.ts": "Empty file, likely placeholder for BaconOps desktop keyboard/mouse controls hook.",
  "frontend/src/game/baconOps/input/useTouchControls.ts": "Empty file, likely placeholder for BaconOps touch controls hook.",
  "frontend/src/game/baconOps/input/VirtualControls.tsx": "Empty file, likely placeholder for BaconOps virtual/touch controls component.",
  "frontend/src/game/baconOps/ui/BaconOpsMainMenu.tsx": "Empty file, likely placeholder for BaconOps game main menu component.",
  "frontend/src/game/baconOps/ui/Hud.tsx": "Empty file, likely placeholder for BaconOps game HUD component.",
  "frontend/src/game/baconOps/ui/RoundOverlay.tsx": "Empty file, likely placeholder for BaconOps round start/end overlay component.",
  "frontend/src/game/baconOps/ui/StatsPanel.tsx": "Empty file, likely placeholder for BaconOps game statistics panel component.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance with Internet Identity authentication. Invalidates dependent queries when actor changes and handles admin token initialization.",
  "frontend/src/hooks/useAdultGate.ts": "Hook for managing adult content consent using sessionStorage. Provides consent state, loading state, and methods to grant/revoke consent.",
  "frontend/src/hooks/useAuthz.ts": "Authorization hooks that query caller's role and admin status from the backend actor. Depends on authenticated identity and actor availability.",
  "frontend/src/hooks/useChatRooms.ts": "React Query hooks for chat room operations: fetching all rooms, fetching room messages (with 2.5s polling), and posting messages with automatic cache invalidation.",
  "frontend/src/hooks/useConversations.ts": "React Query hooks for AI conversation management: fetching all conversations, fetching single conversation by ID, and storing conversations with cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including channels (CRUD), user profiles, Bacon Cash requests, conversations, and admin functions using the actor from useActor hook.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining color schemes for UI components, bacon-ops styling, AI chat, and chat room appearances.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClientProvider and InternetIdentityProvider wrappers for state management and authentication.",
  "frontend/src/pages/AdminBaconCashRequestsPage.tsx": "Admin-only page displaying all Bacon Cash purchase requests in a table with the ability to fulfill pending requests and view completion status.",
  "frontend/src/pages/AIChatPage.tsx": "AI chat interface with conversation management, rule-based response generation for RockHog TV topics, message history, and conversation persistence using backend storage.",
  "frontend/src/pages/BaconOpsArenaPage.tsx": "Empty file placeholder for the Bacon Ops Arena page component.",
  "frontend/src/pages/BrowseHomePage.tsx": "Main browsing page featuring a hero banner, category grid with icons for navigation, and a grid of recently added channels.",
  "frontend/src/pages/BuyBaconCashPage.tsx": "Page for authenticated users to request Bacon Cash purchases and view their request history with status badges. Displays current balance and provides a form to submit purchase requests that admins will process.",
  "frontend/src/pages/CategoryPage.tsx": "Displays all channels filtered by category with category icon and count. Wraps adult category content in AdultRouteGuard for age verification.",
  "frontend/src/pages/ChatRoomPage.tsx": "Chat room interface with sidebar for room selection and main area for messages and input. Requires authentication and user profile to post messages.",
  "frontend/src/pages/ContactPage.tsx": "Simple contact page displaying owner email address with a mailto button. Shows email in a centered card layout.",
  "frontend/src/pages/CreatorStudioPage.tsx": "Dashboard for authenticated users to manage their channels with create, edit, and delete functionality. Displays channel cards with stream keys, RTMP URLs, and copy-to-clipboard buttons.",
  "frontend/src/pages/SignUpPage.tsx": "Sign-up page that initiates Internet Identity authentication and explains the secure blockchain-based auth system. Redirects authenticated users to home after 2 seconds.",
  "frontend/src/pages/StreamDetailPage.tsx": "Individual channel detail page with embedded stream player, channel metadata, and edit/delete controls for owners and admins. Wraps adult content in AdultRouteGuard.",
  "frontend/src/utils/category.ts": "Defines canonical category values, display labels, and utility functions for consistent category handling. Exports type-safe category constants and label mapping functions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH color space, container settings, border radius variables, custom animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document tracking 8 implemented features for RockHog TV streaming platform including category navigation, channel management, viewer browsing, adult content gating, Bacon Cash virtual currency, authentication via Internet Identity, and visual theming."
}