{
  "backend/main.mo": "Motoko canister implementing channel management, user profiles, categories, access control, and storage mixins.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference.",
  "frontend/index.css": "Tailwind base configuration defining color variables and themes for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/account/AccountSummary.tsx": "Displays user name and Bacon Cash balance with a button to buy more.",
  "frontend/src/components/admin/AdminOnly.tsx": "Restricts content to admins, showing loading or access denied when appropriate.",
  "frontend/src/components/adult/AdultGateDialog.tsx": "Modal dialog requiring age confirmation before viewing adult content.",
  "frontend/src/components/adult/AdultRouteGuard.tsx": "Blocks protected content until adult-content consent is granted.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Generic access denied page with a return-home button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "First‑time user dialog to set a display name and create a profile.",
  "frontend/src/components/auth/RoleGate.tsx": "Conditional render gate enforcing admin or channel‑owner permissions.",
  "frontend/src/components/branding/BrandLogo.tsx": "Clickable RockHog TV logo that navigates to the home page.",
  "frontend/src/components/branding/CategoryIcon.tsx": "Maps category names to icon image paths and renders the matching image with optional sizing classes.",
  "frontend/src/components/branding/HeroBanner.tsx": "Displays a large hero banner with background image, title, and description overlay.",
  "frontend/src/components/channels/ChannelCard.tsx": "Renders a clickable card for a channel with thumbnail, title, category badge, and description.",
  "frontend/src/components/channels/ChannelEditorDialog.tsx": "Provides a dialog form to create or edit a channel, handling validation, thumbnail upload, and mutations.",
  "frontend/src/components/channels/ChannelGrid.tsx": "Shows a responsive grid of ChannelCard components with loading and empty states.",
  "frontend/src/components/channels/ThumbnailUploader.tsx": "Handles image file selection, upload progress, preview, and removal for channel thumbnails.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, footer, navigation, authentication UI, and profile setup trigger.",
  "frontend/src/components/navigation/PrimaryNav.tsx": "Renders the primary category navigation and optional Creator Studio link based on authentication.",
  "frontend/src/components/player/StreamEmbed.tsx": "Embeds a stream URL by auto-detecting provider or using raw embed code, with fallback for missing streams.",
  "frontend/src/components/share/ShareButton.tsx": "Provides a share button using Web Share API or clipboard fallback with toast notifications.",
  "frontend/src/game/baconOps/engine/ai.ts": "Empty placeholder file for AI systems in the BaconOps engine.",
  "frontend/src/game/baconOps/engine/constants.ts": "Empty placeholder for BaconOps engine constants.",
  "frontend/src/game/baconOps/engine/gameLoop.ts": "Empty placeholder for the BaconOps main game loop implementation.",
  "frontend/src/game/baconOps/engine/gameState.ts": "Empty placeholder for BaconOps game state management.",
  "frontend/src/game/baconOps/engine/renderer.ts": "Empty placeholder for BaconOps rendering logic.",
  "frontend/src/game/baconOps/engine/systems.ts": "Empty placeholder for BaconOps ECS or game systems.",
  "frontend/src/game/baconOps/engine/types.ts": "Empty placeholder for shared BaconOps engine types.",
  "frontend/src/game/baconOps/input/useDesktopControls.ts": "Empty placeholder hook for desktop control input handling.",
  "frontend/src/game/baconOps/input/useTouchControls.ts": "Empty placeholder hook for touch control input handling.",
  "frontend/src/game/baconOps/input/VirtualControls.tsx": "Empty placeholder for virtual touch/game controls UI.",
  "frontend/src/game/baconOps/ui/BaconOpsMainMenu.tsx": "Empty placeholder for the BaconOps main menu UI.",
  "frontend/src/game/baconOps/ui/Hud.tsx": "Empty placeholder for the BaconOps HUD UI.",
  "frontend/src/game/baconOps/ui/RoundOverlay.tsx": "Empty placeholder for the BaconOps round transition overlay.",
  "frontend/src/game/baconOps/ui/StatsPanel.tsx": "Empty placeholder for the BaconOps stats panel UI.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useAdultGate.ts": "Provides a hook managing adult-gate consent using sessionStorage with helpers to grant or revoke consent.",
  "frontend/src/hooks/useAuthz.ts": "Exposes hooks to fetch caller role and admin status via react-query and actor methods.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines Internet Identity context, provider, and hooks for authentication and identity loading via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Contains react-query hooks for fetching and mutating channels, user profiles, and other backend resources.",
  "frontend/src/index.css": "Tailwind CSS setup with theme variables, dark mode styles, and custom utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminBaconCashRequestsPage.tsx": "Admin page listing bacon cash requests with actions to fulfill them.",
  "frontend/src/pages/BaconOpsArenaPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/BrowseHomePage.tsx": "Home browse page showing categories and recent channels using fetched channel data.",
  "frontend/src/pages/BuyBaconCashPage.tsx": "Provides a form for users to request Bacon Cash purchases and displays their past requests and current balance.",
  "frontend/src/pages/CategoryPage.tsx": "Loads channels for a given category and displays them, with adult categories gated behind an age check.",
  "frontend/src/pages/ContactPage.tsx": "Shows a contact card with the owner's email and a mailto link for user inquiries.",
  "frontend/src/pages/CreatorStudioPage.tsx": "Allows authenticated creators to manage their channels, including creating, editing, deleting, and copying channel fields.",
  "frontend/src/pages/StreamDetailPage.tsx": "Displays a single stream's player and metadata with edit and delete options for owners or admins.",
  "frontend/src/utils/category.ts": "Defines category values, labels, and helpers for retrieving category metadata and display names.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash-based handling.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended color system using CSS variables, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project metadata, versioning, and a list of implemented features for the RockHog TV platform, including categories, admin workflows, browsing pages, gating, currency, and authentication."
}