{
  "backend/main.mo": "Main actor implementing a streaming platform with channels, chat rooms, Bacon Cash payments, AI conversations, user profiles, and access control; includes blob storage and authorization mixins with migration support.",
  "backend/migration.mo": "Migration module that transforms OldChannel records to NewChannel records by adding a chatRoomId field, preserving all other actor state during upgrades.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including StreamChatPanel, TipDialog, payment history hooks, and their associated test IDs and component dependencies.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and hooks including chat, payment, authentication, channel management, and UI utilities.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for the RockHog TV application.",
  "frontend/index.html": "HTML entry point for the RockHog TV React application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for browse, categories, streams, creator studio, admin, contact, sign-up, AI chat, chat room, and payment history pages.",
  "frontend/src/components/account/AccountSummary.tsx": "Header widget displaying authenticated user's name, Bacon Cash balance, and a Buy button linking to the purchase page.",
  "frontend/src/components/admin/AdminOnly.tsx": "Route guard component that restricts access to admin-only pages by checking authentication and admin role status.",
  "frontend/src/components/adult/AdultGateDialog.tsx": "Modal dialog requiring age confirmation (18+) before allowing access to adult content with warning message and confirm/cancel actions.",
  "frontend/src/components/adult/AdultRouteGuard.tsx": "A route guard component that displays an age verification dialog for adult content and redirects users who decline consent back to the home page.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied screen with a shield icon, customizable message, and a button to return to the home page.",
  "frontend/src/components/auth/LoginButton.tsx": "A button component that handles Internet Identity login/logout with loading states and error handling, clearing the query cache on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "A modal dialog for new users to create their profile by entering a display name, initializing their Bacon Cash balance and best score to zero.",
  "frontend/src/components/auth/RoleGate.tsx": "A permission gate component that conditionally renders children based on admin status or channel ownership, hiding content when authorization fails.",
  "frontend/src/components/branding/BrandLogo.tsx": "Displays the RockHog TV logo and brand name as a clickable button that navigates to the home page.",
  "frontend/src/components/branding/CategoryIcon.tsx": "Renders category-specific icons from a predefined map of category names to image paths, falling back to the music icon if not found.",
  "frontend/src/components/branding/HeroBanner.tsx": "Displays a hero banner with a background image and overlay text promoting RockHog TV as a streaming platform for various content types.",
  "frontend/src/components/channels/ChannelCard.tsx": "A card component displaying channel thumbnail, title, category badge, and description with hover effects and navigation to the stream page on click.",
  "frontend/src/components/channels/ChannelEditorDialog.tsx": "A dialog form for creating or editing channels with fields for title, category, description, stream URL, and thumbnail upload, handling both create and update mutations.",
  "frontend/src/components/channels/ChannelGrid.tsx": "Displays a responsive grid of channel cards with loading and empty states, supporting customizable empty messages.",
  "frontend/src/components/channels/ThumbnailUploader.tsx": "Handles thumbnail image upload with progress tracking, preview display, and removal functionality using ExternalBlob for file handling.",
  "frontend/src/components/channels/TipDialog.tsx": "A dialog for sending Bacon Cash tips to channel owners, displaying user balance, validating tip amounts, and allowing optional messages with character limits.",
  "frontend/src/components/chat/ChatInput.tsx": "A textarea-based chat input component with send button that handles Enter key submission and Shift+Enter for new lines.",
  "frontend/src/components/chat/ChatRoomList.tsx": "Displays a scrollable list of available chat rooms fetched via useGetChatRooms hook, with loading and error states.",
  "frontend/src/components/chat/ConversationList.tsx": "Shows a list of AI chat conversations with message previews and selection handling, including empty and loading states.",
  "frontend/src/components/chat/MessageBubble.tsx": "Renders individual chat messages with different styling for AI vs user messages, including avatars with icons.",
  "frontend/src/components/chat/MessageList.tsx": "Displays chat room messages in a scrollable area with auto-scroll on new messages, timestamps, and sender names.",
  "frontend/src/components/chat/StreamChatPanel.tsx": "Main chat panel component that combines MessageList and ChatInput, requiring authentication to send messages.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header (logo, nav, login), footer (social links, caffeine.ai attribution), and profile setup dialog.",
  "frontend/src/components/navigation/PrimaryNav.tsx": "Primary navigation bar with category buttons (Music, Gaming, Sports, Horror, Adult), AI Chat, Chat Room, and authenticated-only Creator Studio and Earnings links.",
  "frontend/src/components/player/StreamEmbed.tsx": "Embeds video streams from URLs or embed codes, with special handling for YouTube and Twitch URLs.",
  "frontend/src/components/share/ShareButton.tsx": "Share button that uses Web Share API when available, otherwise falls back to copying URL to clipboard.",
  "frontend/src/game/baconOps/engine/ai.ts": "Empty file for BaconOps game AI logic.",
  "frontend/src/game/baconOps/engine/constants.ts": "Empty file for BaconOps game constants.",
  "frontend/src/game/baconOps/engine/gameLoop.ts": "Empty file for BaconOps game loop implementation.",
  "frontend/src/game/baconOps/engine/gameState.ts": "Empty file for BaconOps game state management.",
  "frontend/src/game/baconOps/engine/renderer.ts": "Empty file for BaconOps game rendering logic.",
  "frontend/src/game/baconOps/engine/systems.ts": "Empty file for BaconOps game systems.",
  "frontend/src/game/baconOps/engine/types.ts": "Empty file for BaconOps game type definitions.",
  "frontend/src/game/baconOps/input/useDesktopControls.ts": "Empty file for BaconOps desktop keyboard/mouse controls hook.",
  "frontend/src/game/baconOps/input/useTouchControls.ts": "Empty file for BaconOps touch controls hook.",
  "frontend/src/game/baconOps/input/VirtualControls.tsx": "Empty file for BaconOps virtual/touch controls component.",
  "frontend/src/game/baconOps/ui/BaconOpsMainMenu.tsx": "Empty file for BaconOps main menu UI component.",
  "frontend/src/game/baconOps/ui/Hud.tsx": "Empty file for BaconOps heads-up display component.",
  "frontend/src/game/baconOps/ui/RoundOverlay.tsx": "Empty file for BaconOps round start/end overlay component.",
  "frontend/src/game/baconOps/ui/StatsPanel.tsx": "Empty file for BaconOps statistics panel component.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useAdultGate.ts": "Provides adult content consent management using sessionStorage, with methods to grant, revoke, and check consent status.",
  "frontend/src/hooks/useAuthz.ts": "Provides authorization hooks to query the caller's user role and admin status from the backend actor.",
  "frontend/src/hooks/useChatRooms.ts": "Manages chat room operations including fetching all rooms, retrieving messages with 2.5-second polling, and posting new messages with automatic query invalidation.",
  "frontend/src/hooks/useConversations.ts": "Provides hooks for fetching, retrieving individual conversations, and storing AI chat conversations with automatic cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with login, logout, identity management, and configurable AuthClient options including derivation origin support.",
  "frontend/src/hooks/useQueries.ts": "Provides comprehensive React Query hooks for channels (CRUD operations), user profiles, Bacon Cash requests, streamer payments, and batch queries for multiple user profiles.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark themes, including specialized color schemes for bacon-ops, AI chat, and chat room components with streaming gradients.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminBaconCashRequestsPage.tsx": "Admin page for viewing and fulfilling user Bacon Cash purchase requests. Displays a table of all requests with their status and provides a fulfill button for pending requests.",
  "frontend/src/pages/AIChatPage.tsx": "Implements an AI chat interface with conversation management, rule-based response generation for RockHog TV topics, message history, and sidebar navigation for switching between conversations.",
  "frontend/src/pages/BaconOpsArenaPage.tsx": "Empty file with no content.",
  "frontend/src/pages/BrowseHomePage.tsx": "Main browse page displaying a hero banner, category grid for navigation, and recently added channels. Users can click categories to navigate to category-specific pages.",
  "frontend/src/pages/BuyBaconCashPage.tsx": "User-facing page for requesting Bacon Cash purchases. Shows current balance, a form to submit purchase requests, and a list of the user's previous requests with their status.",
  "frontend/src/pages/CategoryPage.tsx": "Displays channels filtered by category with category icon and count. Wraps adult category content in AdultRouteGuard for age verification.",
  "frontend/src/pages/ChatRoomPage.tsx": "Live chat room interface with sidebar for room selection and main area for messages and input. Requires authentication and user profile to participate.",
  "frontend/src/pages/ContactPage.tsx": "Simple contact page displaying the owner's email address with a mailto link button.",
  "frontend/src/pages/CreatorStudioPage.tsx": "Creator dashboard for managing channels with create, edit, and delete functionality. Displays channel details with copy-to-clipboard buttons for IDs and stream keys.",
  "frontend/src/pages/PaymentHistoryPage.tsx": "Displays a tabbed interface showing received and sent payment tips with formatted timestamps and amounts, requiring Internet Identity authentication to view transaction history.",
  "frontend/src/pages/SignUpPage.tsx": "Sign-up page that uses Internet Identity for authentication, displays feature cards about secure authentication and personalized profiles, and redirects authenticated users to home.",
  "frontend/src/pages/StreamDetailPage.tsx": "Stream detail page with embedded player, chat panel, channel info, and admin/owner controls for editing, deleting, and tipping channels, wrapped in adult content guard.",
  "frontend/src/utils/category.ts": "Defines streaming category types and provides utility functions to map category values to display labels (Music, Gaming, Sports, Horror, Adult, etc.).",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme for UI components (sidebar, chart, card colors), container settings, and animation keyframes.",
  "project_state.json": "Project state file tracking RockHog TV streaming platform features including channel management, content categories (Music/Gaming/Sports/Horror/Adult), Bacon Cash virtual currency, Internet Identity authentication, and tipping functionality. Contains 12 implemented features with architectural notes specifying the public share URL as rockhogtv.caffeine.xyz."
}