{
  "backend/main.mo": "Actor canister with channel categories, user profiles, access control, and storage; defines types and queries/mutations for channels, profiles, and stats.",
  "backend/migration.mo": "Migrates old channel data to the expanded category set by mapping legacy categories to new ones.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related files, components, and tests for category expansion and UI updates.",
  "frontend-file-summaries.txt": "Text file summarizing all major frontend files and their roles in the application.",
  "frontend/index.css": "Global Tailwind-based styling with light/dark theme variables and base resets.",
  "frontend/index.html": "HTML entry point mounting the root React application.",
  "frontend/src/App.tsx": "Defines the router, routes, and theme provider for all pages in the app.",
  "frontend/src/components/account/AccountSummary.tsx": "Displays user name and Bacon Cash balance with a button to purchase more.",
  "frontend/src/components/admin/AdminOnly.tsx": "Wrapper enforcing admin access, showing loaders or denied screens as needed.",
  "frontend/src/components/adult/AdultGateDialog.tsx": "Modal asking for adult-content age confirmation with confirm and cancel actions.",
  "frontend/src/components/adult/AdultRouteGuard.tsx": "Guards adult routes by checking consent and showing the adult gate dialog when required.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with an icon and a button to return home.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity with loading and error handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog prompting new users to enter a display name and create their profile.",
  "frontend/src/components/auth/RoleGate.tsx": "Conditionally renders children based on authentication, admin status, and channel ownership.",
  "frontend/src/components/branding/BrandLogo.tsx": "Clickable brand logo that navigates to the home page.",
  "frontend/src/components/branding/CategoryIcon.tsx": "Displays a category-specific icon based on a mapped image list.",
  "frontend/src/components/branding/HeroBanner.tsx": "Large hero banner with background image and marketing text.",
  "frontend/src/components/channels/ChannelCard.tsx": "Card showing a channel’s thumbnail, title, category badge, and description, linking to the stream page.",
  "frontend/src/components/channels/ChannelEditorDialog.tsx": "Form dialog for creating or editing channels with fields, validation, and thumbnail upload.",
  "frontend/src/components/channels/ChannelGrid.tsx": "Displays a grid of channel cards with loading and empty states.",
  "frontend/src/components/channels/ThumbnailUploader.tsx": "Handles thumbnail image selection, upload progress, previewing, and removal.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, navigation, footer, auth controls, and optional profile setup dialog.",
  "frontend/src/components/navigation/PrimaryNav.tsx": "Top navigation bar for category links, Bacon Ops, and Creator Studio access when authenticated.",
  "frontend/src/components/player/StreamEmbed.tsx": "Embeds a video stream by detecting iframe, YouTube, or Twitch URLs and renders fallback alerts if missing.",
  "frontend/src/components/share/ShareButton.tsx": "Provides a share button using the Web Share API or clipboard fallback with toast notifications.",
  "frontend/src/game/baconOps/engine/ai.ts": "Implements simple enemy AI behaviors including stationary and basic patrol direction setup.",
  "frontend/src/game/baconOps/engine/constants.ts": "Defines gameplay constants for player, enemy, projectile stats, and scoring.",
  "frontend/src/game/baconOps/engine/gameLoop.ts": "Runs the main game loop, updating state, processing input, and rendering each frame.",
  "frontend/src/game/baconOps/engine/gameState.ts": "Initializes the game state with player and enemy setup based on mode and canvas size.",
  "frontend/src/game/baconOps/engine/renderer.ts": "Renders the player, enemies, and projectiles onto the canvas with image assets and basic graphics.",
  "frontend/src/game/baconOps/engine/systems.ts": "Contains core gameplay systems for movement, aiming, projectiles, enemy behavior, collision detection, and scoring.",
  "frontend/src/game/baconOps/engine/types.ts": "Defines shared TypeScript interfaces for game entities, state, input, and modes.",
  "frontend/src/game/baconOps/input/useDesktopControls.ts": "Provides keyboard and mouse input handling for desktop gameplay, updating movement and firing states.",
  "frontend/src/game/baconOps/input/useTouchControls.ts": "Provides touch-control input state and callbacks for movement, aiming, and firing, with disabled mode returning defaults.",
  "frontend/src/game/baconOps/input/VirtualControls.tsx": "Implements mobile touch controls including a joystick and fire button using touch events.",
  "frontend/src/game/baconOps/ui/BaconOpsMainMenu.tsx": "Renders the main menu with selectable game modes, start button, and user stats panel.",
  "frontend/src/game/baconOps/ui/Hud.tsx": "Displays in‑game HUD showing health, score, and round info with icons and a dynamic health bar.",
  "frontend/src/game/baconOps/ui/RoundOverlay.tsx": "Shows victory/defeat overlay with final score and buttons to restart or return to menu.",
  "frontend/src/game/baconOps/ui/StatsPanel.tsx": "Shows login prompt or authenticated user's best score using Internet Identity and query hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useAdultGate.ts": "Manages session‑stored adult‑consent state with functions to grant or revoke it.",
  "frontend/src/hooks/useAuthz.ts": "Fetches caller user role and admin status using actor-based queries gated by identity readiness.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identity, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching and mutating channels and user profiles through the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers, theme color variables for light and dark modes, and custom Bacon Ops UI classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminBaconCashRequestsPage.tsx": "Displays all Bacon Cash purchase requests for admins and provides controls to fulfill them.",
  "frontend/src/pages/BaconOpsArenaPage.tsx": "Runs the Bacon Ops Arena game, handling canvas setup, input, game loop, and best score updates.",
  "frontend/src/pages/BrowseHomePage.tsx": "Shows the home browsing page with categories and recently added channels.",
  "frontend/src/pages/BuyBaconCashPage.tsx": "Allows users to request Bacon Cash purchases and view the status of their past requests.",
  "frontend/src/pages/CategoryPage.tsx": "Displays channels filtered by category, with adult-category protection when needed.",
  "frontend/src/pages/ContactPage.tsx": "Provides contact information and a mailto link for reaching the site owner.",
  "frontend/src/pages/CreatorStudioPage.tsx": "Creator dashboard for listing, creating, editing, deleting channels with clipboard copy helpers and identity gating.",
  "frontend/src/pages/StreamDetailPage.tsx": "Stream detail page that loads a channel, embeds the stream, shows metadata, and provides edit/delete options for authorized users.",
  "frontend/src/utils/category.ts": "Defines category constants, labels, and helper functions for retrieving category metadata and display names.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes, colors, animations, and plugins for the frontend UI.",
  "project_state.json": "Project metadata describing features, state versioning, architecture notes, and image requirements."
}