{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add per-stream live chat and viewer payment options for streamers",
  "requirements": [
    {
      "id": "REQ-55",
      "summary": "Add StreamChatPanel component that embeds live chat on stream detail pages",
      "acceptanceCriteria": [
        "StreamChatPanel component is created and accepts a chatRoomId prop",
        "Component reuses existing MessageList and ChatInput components for consistency",
        "Component fetches and displays messages for the specific chat room using useGetChatRoomMessages with polling enabled",
        "Authenticated users can post messages to the stream's chat room",
        "Component shows appropriate loading and error states"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/chat/StreamChatPanel.tsx",
          "operation": "create",
          "description": "Create StreamChatPanel component that accepts chatRoomId prop and composes MessageList and ChatInput. Use useGetChatRoomMessages hook with polling enabled (2.5s interval) to fetch messages. Use usePostMessage mutation for sending messages. Include authentication checks and show login prompt for unauthenticated users. Handle loading, error, and empty states appropriately."
        }
      ]
    },
    {
      "id": "REQ-56",
      "summary": "Integrate StreamChatPanel into StreamDetailPage for unified watch-and-chat experience",
      "acceptanceCriteria": [
        "StreamChatPanel is rendered on the StreamDetailPage below or beside the StreamEmbed component",
        "The panel receives the channel's chatRoomId from the channel data",
        "Layout is responsive and works on both desktop and mobile viewports",
        "If the channel has no associated chat room, a fallback message is displayed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StreamDetailPage.tsx",
          "operation": "modify",
          "description": "Import and render StreamChatPanel component below the StreamEmbed component. Pass channel.chatRoomId to the panel. Add responsive layout using flex or grid to position chat beside or below the player depending on viewport size. Show fallback message if channel.chatRoomId is null or undefined. Ensure the integration works within the existing AdultRouteGuard wrapper."
        }
      ]
    },
    {
      "id": "REQ-60",
      "summary": "Create useSendTip mutation hook for sending Bacon Cash tips to streamers",
      "acceptanceCriteria": [
        "useSendTip mutation hook is created in frontend/src/hooks/useQueries.ts",
        "Hook accepts channelId, amount, and optional message as parameters",
        "On success, invalidates user profile and payment history queries",
        "Hook returns loading, error, and success states"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useSendTip mutation hook using useMutation from React Query. Hook should call actor.sendTip with sender (from identity), recipient (derived from channel owner), channelId, amount, and optional message. On success, invalidate 'currentUserProfile' and payment history queries. Return standard mutation states (isPending, isError, isSuccess, error, mutate, mutateAsync)."
        }
      ]
    },
    {
      "id": "REQ-61",
      "summary": "Create usePaymentHistory hook for fetching received and sent payments",
      "acceptanceCriteria": [
        "usePaymentHistory hook is created in frontend/src/hooks/useQueries.ts",
        "Hook fetches both getPaymentsReceived and getPaymentsSent",
        "Hook is only enabled when user is authenticated",
        "Hook returns loading, error, and data states for both payment types"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add usePaymentHistory hook that uses useQueries to fetch both actor.getPaymentsReceived and actor.getPaymentsSent in parallel. Both queries should be enabled only when actor is available and user is authenticated (identity exists). Return combined state with received and sent payment arrays, loading states, and error states."
        }
      ]
    },
    {
      "id": "REQ-62",
      "summary": "Add TipDialog component for sending Bacon Cash tips with amount input and message field",
      "acceptanceCriteria": [
        "TipDialog component is created with shadcn Dialog composition",
        "Form includes a number input for tip amount (positive integers only)",
        "Form includes an optional textarea for a message to the streamer",
        "Current Bacon Cash balance is displayed prominently",
        "Form validates that amount does not exceed available balance",
        "Submit button triggers useSendTip mutation",
        "Success shows a toast notification and closes the dialog",
        "Error shows an error toast with the failure reason"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/channels/TipDialog.tsx",
          "operation": "create",
          "description": "Create TipDialog component using shadcn Dialog, DialogContent, DialogHeader, DialogTitle, DialogDescription. Accept props: open, onOpenChange, channelId, channelTitle, channelOwner. Display user's current Bacon Cash balance from useGetCallerUserProfile. Include number input for amount (min 1, validate against balance), textarea for optional message. Use useSendTip mutation hook. On success, show toast notification ('Tip sent successfully!'), close dialog, and reset form. On error, show toast with error message. Use Button with loading state during mutation."
        }
      ]
    },
    {
      "id": "REQ-63",
      "summary": "Add 'Send Tip' button to StreamDetailPage that opens TipDialog for authenticated viewers",
      "acceptanceCriteria": [
        "A 'Send Tip' or 'Tip Streamer' button is added to the StreamDetailPage near the channel metadata or chat panel",
        "Button is only visible to authenticated users who are not the channel owner",
        "Clicking the button opens the TipDialog with the current channel ID",
        "Button uses appropriate icon (e.g., DollarSign, Coins) and styling"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StreamDetailPage.tsx",
          "operation": "modify",
          "description": "Import TipDialog component and manage its open state with useState. Add a 'Tip Streamer' button with Coins or DollarSign icon from lucide-react positioned near channel metadata or above the chat panel. Only show button if user is authenticated (identity exists) and is not the channel owner (compare identity.getPrincipal() with channel.owner). Button onClick sets dialog open state to true. Render TipDialog with controlled open state, passing channelId, channel.title, and channel.owner as props."
        }
      ]
    },
    {
      "id": "REQ-64",
      "summary": "Create PaymentHistoryPage displaying received and sent tips in tabs",
      "acceptanceCriteria": [
        "PaymentHistoryPage component is created with tabs for received and sent payments",
        "Each tab displays a list or table of payments with all relevant details",
        "Payment amounts are clearly displayed with Bacon Cash formatting",
        "Timestamps are formatted in a user-friendly way",
        "Empty state is shown when no payments exist in a tab",
        "Loading and error states are handled appropriately"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PaymentHistoryPage.tsx",
          "operation": "create",
          "description": "Create PaymentHistoryPage component using shadcn Tabs, TabsList, TabsTrigger, TabsContent for 'Tips Received' and 'Tips Sent' tabs. Use usePaymentHistory hook to fetch payment data. Display payments in a Card or Table with columns: timestamp (formatted with Intl.DateTimeFormat or date-fns), channel ID/title, sender/recipient name (fetch using getUserProfile if needed), amount (formatted as 'X Bacon Cash'), and optional message. Show loading spinner during fetch. Show error alert if fetch fails. Show empty state message ('No tips received/sent yet') when payment arrays are empty. Wrap in AppLayout."
        }
      ]
    },
    {
      "id": "REQ-65",
      "summary": "Add route for payment history page and navigation entry point in user menu",
      "acceptanceCriteria": [
        "Route /payment-history is added to the router configuration",
        "Route is protected and requires authentication",
        "A navigation link to 'Payment History' or 'Earnings' is added in an appropriate location (account menu, Creator Studio, or footer)",
        "Link is only visible to authenticated users"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import PaymentHistoryPage component. Add a new Route with path '/payment-history' and component={PaymentHistoryPage}. No authentication guard is needed in the route itself since the page will handle showing appropriate content based on auth state."
        },
        {
          "path": "frontend/src/components/navigation/PrimaryNav.tsx",
          "operation": "modify",
          "description": "Add a navigation button or link for 'Payment History' or 'Earnings' that navigates to '/payment-history'. Only show this link when user is authenticated (check identity from useInternetIdentity). Position it logically near other user-specific navigation items (e.g., after Creator Studio or in a user menu dropdown if one exists)."
        }
      ]
    }
  ]
}